import Head from 'next/head'
import PageHeader from '@/components/page-header'
import SectionWrapper from '@/components/section-wrapper'

export default function Terms () {
  return (
    <>
      <Head>
        <title>利用規約 - Universal Cube Resort</title>
      </Head>
      
      <PageHeader
        title='利用規約'
      />

      <SectionWrapper>
        <section className='section prose'>
          <h4>本規約に含まれる内容</h4>
          <p>Universal Cube Resort（以下UCR）の利用に関するもの及び使用している権利に関するものを含みます。</p>
          <h4>1. 規約への同意</h4>
          <p>UCRに関するサービスに参加、体験をした場合、この規約へ同意したものとみなします。また、規約内容を理解できていないと判断した場合は、UCRが展開する全てのプログラム及びサービスの利用をお断りします。</p>
          <h4>2. 規約の変更</h4>
          <p>この規約は、事前に予告なくUCRにより変更されます。また、以下に示す団体・企業により変更の要請が行われた場合、それに従い、事前に予告なくUCRにより変更されます。</p>
          <ul>
            <li>合同会社ユー・エス・ジェイ</li>
            <li>Universal City Studios LLC</li>
            <li>NBCUniversal Media, LLC</li>
            <li>Amblin Partners</li>
            <li>Illumination</li>
            <li>Comcast Corporation</li>
            <li>モンキーパンチ/TMS・NTV</li>
            <li>株式会社任天堂</li>
            <li>Sanrio Company, Ltd.</li>
            <li>LINE株式会社</li>
            <li>Discord Inc.</li>
            <li>Google LLC</li>
            <li>Microsoft Corporation</li>
            <li>Mojang Studios</li>
          </ul>
          <h4>3. プラットフォームについて</h4>
          <p>(1) UCRはMojang Studiosのゲームである「Minecraft (Bedrock Edition）」において展開している仮想テーマパークプロジェクト及びサービスです。</p>
          <p>(2) UCR FAN及びUCR FAN CLUBはLINE株式会社のサービスである「LINEオープンチャット」及びDiscord Inc.のサービスである「Discord」において展開しているコミュニティープログラムです。</p>
          <h4>4. 情報収集について</h4>
          <p>UCRが展開するプログラム、サービスの利用に伴って、UCRが収集できる全ての情報を取得し、記録、保管します。これらは、プログラム及びサービスの運営品質向上のために利用します。また、UCRの利用するプラットフォームにより、収集が行われている場合があります。</p>
          <h4>5. サービスの体験における禁止事項と違反者への対処方法について</h4>
          <h5>(1) アトラクション</h5>
          <ul>
            <li>アトラクション毎に注意事項を記載した看板を設置しております。よくお読みになった上で体験して頂きますようお願い致します。</li>
            <li>アトラクション乗車中にライドから下車される行為は運営の妨げとなりますので絶対におやめください。</li>
          </ul>
          <h5>(2) パーク内</h5>
          <ul>
            <li>チートの使用、荒らし行為、他のゲストへの暴力行為、チャットでの不適切な発言、立ち入りが規制されているエリアへの侵入は絶対におやめください。</li>
            <li>名前にCREWと表記のあるプレイヤーの指示には従って下さい。</li>
          </ul>
          <p>※額縁内にアイテムを入れる行為、また回転させるのも迷惑になりますのでおやめください。</p>
          <h5>(3) パーク内での撮影</h5>
          <ul>
            <li>パーク内での写真撮影、動画撮影、SNS等への投稿はご自由にどうぞ。（#UCResort をつけて投稿して頂けると嬉しいです。）</li>
            <li>収益を伴う動画の撮影をされる場合、公式ツイッターで予め申告して頂きますようお願い致します。（著作権侵害になる可能性のあるコンテンツがあります。規約内の「９．権利関係について」を参照してください。）</li>
          </ul>
          <h5>(4) その他</h5>
          <ul>
            <li>建築物の模倣、自作発言は絶対におやめください。</li>
            <li>12歳以下（小学生等）のワールドの参加は、親権者の同意の上、参加者及び同意した親権者に責任が生じます。</li>
          </ul>
          <h5>これら禁止事項に違反された場合、パークからの退場、又今後のパークへのご入場をお断りさせて頂きます。</h5>
          <h4>6. プラットフォームでの利用規約について</h4>
          <p>(1) 「Minecraft (Bedrock Edition）」の利用規約についてはMojang Studiosの「MINECRAFT 利用規約および エンド ユーザー使用許諾契約書」を確認してください。</p>
          <p>(2) 「LINEオープンチャット」の利用規約についてはLINE株式会社の「LINEオープンチャット利用規約」を確認してください。</p>
          <p>(3) 「Discord」の利用規約についてはDiscord Inc.の「Discordコミュニティガイドライン」を確認してください。</p>
          <p>(4) 各プラットフォームにおいて発生する全ての事象について、UCRは一切の責任を負わず、全て利用者自身の責任となります。</p>
          <h4>7. 収益について</h4>
          <p>UCRの活動のうち“「ユニバーサルスタジオジャパン」の再現”において、UCRの全てのメンバーが収益を得ることはありません。従って、UCRの大半の活動は非営利目的となります。</p>
          <h4>8. 団体について</h4>
          <p>UCRは非営利目的で“テーマパークファンの活動”として結集した、「Minecraft (Bedrock Edition）」を拠点とする非法人団体です。従って、プログラム及びサービスに関わる責任を一切負いません。</p>
          <h4>9. 権利関係について</h4>
          <h5>(1) サービスの提供について</h5>
          <p>UCRの「Minecraft (Bedrock Edition）」におけるサービスの提供は、日本国著作権法第38条1「営利を目的としない上演等」に基づき、営利を目的とせず、「Minecraft (Bedrock Edition）」という場所において上演しているものとする。</p>
          <h5>(2) システムについて</h5>
          <p>UCRのサービスシステムの権利は「Minecraft (Bedrock Edition）」の開発元である、Mojang Studiosの利用規約に基づいており、UCRの所有するものではありません。</p>
          <h5>(3) スキンについて</h5>
          <p>サービスの利用者の既存のキャラクターと明らかにわかるスキンの利用を、Mojang Studiosの利用規約に基づき、UCRは一切認めません。</p>
          <h5>(4) テクスチャパックについて</h5>
          <p>「Minecraft（Bedrock Edition）」の既存テクスチャ及びキャラクターがデザインされたテクスチャを除き、著作権はUCRが所有します。</p>
          <p>「ミニオンまん」及び「ミニオンのポップコーンバケツ」、「キティチャッキーまん」のテクスチャは&lt;本項(1)&gt;に基づき提供しており、以下の企業より要請が行われた場合、それに従い対処する。</p>
          <ul>
            <li>Universal City Studios LLC</li>
            <li>Sanrio Company, Ltd.</li>
          </ul>
          <h5>(5) キャラクター及び商標について</h5>
          <p>UCRが提供する物のなかで、オリジナルのキャラクターや商標（例:UCRや此和園のロゴ）はUCRが所有しますが、オリジナルではないキャラクター及び商標を使用している場合もあり、その場合は&lt;本項(1)&gt;に基づき提供しており、以下の団体及び企業より要請が行われた場合、それに従い対処する。</p>
          <ul>
            <li>合同会社ユー・エス・ジェイ</li>
            <li>Universal City Studios LLC</li>
            <li>NBCUniversal Media, LLC</li>
            <li>Amblin Partners</li>
            <li>Illumination</li>
            <li>Comcast Corporation</li>
            <li>モンキーパンチ/TMS・NTV</li>
            <li>株式会社任天堂</li>
            <li>Sanrio Company, Ltd.</li>
          </ul>
          <h5>(6) 音楽について</h5>
          <p>UCRで利用する音楽パックの音楽については、&lt;本項(1)&gt;に基づき提供しており、音楽に関してUCRによる依頼で製作されたものも含め、全ての権利は所有せず、著作者の要請があった場合、それに従い対処します。</p>
          <h5>(7) コマンドについて</h5>
          <p>Mojang Studiosの利用規約に基づき、権利は一切所有しません。また、UCRが認めたもの以外コマンドの領布は行いません。</p>
          <h5>(8) 建築物について</h5>
          <p>日本国著作権法第46条「公開の美術の著作物等の利用」に基づき、「Minecraft (Bedrock Edition）」で「ユニバーサルスタジオジャパン」の全ての建築物を“屋外に恒常的に設置された美術”として再現（複製行為）を行ったものです。そのため、同様の解釈によるMinecraft上での再現に対しては権利を所有しませんが、“UCRの再現”と公言しているもの及び明らかな“UCRの模倣行為”と考えられるものに対しては権利を所有します。また、以下の企業より要請が行われた場合、それに従い対処します。</p>
          <ul>
            <li>合同会社ユー・エス・ジェイ</li>
            <li>Universal City Studios LLC</li>
          </ul>
          <h4>10. プログラム及びサービスの停止、終了について</h4>
          <p>UCRが展開するプログラム及びサービスは事前の予告なく、UCRの判断で停止、終了することができます。また、停止、終了に関して、UCRは告知、表記、周知する義務は負いません。</p>
          <h4>11. プログラム及びサービスによって生じた事項の解決方法について</h4>
          <p>利用者に対して生じた事項に関する責任は、UCRは一切負いません。権利者に対して生じた事項に関する責任は、要請を受け、それに従い対処した上で、双方の合意を持って解決します。</p>
          <br />
          <p>2020/05/14発行</p>
        </section>
      </SectionWrapper>
    </>
  )
}
